[{"descriptionEmerald":"In the Battle Pyramid, the wild encounter rate is only decreased by 25%.","id":1,"name":"Stench","description":"While at the head of the party, decreases the wild encounter rate by 50%. Has a 10% flinch chance on damaging moves."},{"id":2,"name":"Drizzle","description":"Changes weather to rain when switched in. In rain, Water moves have 50% increased power and Fire moves have 50% decreased power. Thunder will always hit, Solarbeam deals 50% reduced damage, and Moonlight, Synthesis, and Morning Sun heal for 1/4 max HP"},{"id":3,"name":"Speed Boost","description":"At the end of each turn, raises Speed stat by one stage."},{"id":4,"name":"Battle Armor","description":"Prevents this Pokémon from receiving critical hits."},{"id":5,"name":"Sturdy","description":"Cannot be hit by one-hit KO moves (Fissure, Horn Drill, Guillotine, Sheer Cold)."},{"id":6,"name":"Damp","description":"Prevents allied and opposing Pokémon from using self-destructing moves (Self-Destruct, Explosion)."},{"id":7,"name":"Limber","description":"Cannot be paralyzed. Gaining this Ability, like through Skill Swap, will cure Paralysis."},{"descriptionEmerald":"While at the head of the party, decreases the wild encounter rate by 50% in a sandstorm.","id":8,"name":"Sand Veil","description":"Increases Evasion by 20% in a sandstorm, and this Pokémon takes no end of turn damage in a sandstorm."},{"descriptionEmerald":"While at the head of the party, wild encounters have a 50% chance of being against an Electric Pokémon, if possible.","id":9,"name":"Static","description":"When hit by a contact move, 1/3 chance to paralyze the attacker."},{"id":10,"name":"Volt Absorb","description":"Restores 25% max HP instead of taking damage if hit by a damaging Electric move."},{"id":11,"name":"Water Absorb","description":"Restores 25% max HP instead of taking damage if hit by a damaging Water move."},{"id":12,"name":"Oblivious","description":"Cannot be infatuated, taunted, or intimidated. Gaining this Ability, like through Skill Swap, will cure infatuation."},{"id":13,"name":"Cloud Nine","description":"Negates all effects of weather, but does not end the weather."},{"descriptionEmerald":"Increases the chance of finding a wild Pokémon holding an item.","id":14,"name":"Compoundeyes","description":"Increases the Accuracy of moves by 30% (i.e. Thunder has an Accuracy of 70%. With this ability, it would instead have 70% x 1.3 = 91% Accuracy)."},{"id":15,"name":"Insomnia","description":"Cannot be put to sleep. If this Pokémon uses Rest, it will fail. Gaining this Ability, like through Skill Swap, will cure Sleep."},{"id":16,"name":"Color Change","description":"When hit by a damaging move, changes this Pokémon's type to match the move's type."},{"id":17,"name":"Immunity","description":"Cannot be inflicted with Poison. Gaining this Ability, like through Skill Swap, will cure Poison."},{"id":18,"name":"Flash Fire","description":"Immune to Fire moves. The first time this Pokémon is hit by a Fire move, its own Fire moves gain 50% power."},{"id":19,"name":"Shield Dust","description":"Unaffected by the additional effects of other Pokémon's damaging moves. For example, a Pokémon with this ability cannot be frozen by Blizzard or made to flinch by Fake Out."},{"id":20,"name":"Own Tempo","description":"Cannot be confused or intimidated. Gaining this Ability, like through Skill Swap, will cure confusion."},{"descriptionEmerald":"Increases the chance of getting bites while fishing.","id":21,"name":"Suction Cups","description":"Prevents this Pokémon from being forced to switch out."},{"descriptionEmerald":"While at the head of the party, 50% chance to prevent a wild encounter that would have been with a Pokémon 5 or more levels lower than this Pokémon.","id":22,"name":"Intimidate","description":"Lowers all opposing Pokémons' Attack stats by one stage when this Pokémon enters battle."},{"id":23,"name":"Shadow Tag","description":"Prevents opposing Pokémon from switching out or fleeing."},{"id":24,"name":"Rough Skin","description":"When hit by a contact move, the attacker takes 1/16 of their max HP as damage."},{"id":25,"name":"Wonder Guard","description":"Immune to all damaging moves that are not super effective, except for Struggle, Beat Up, Future Sight, and Doom Desire. Cannot be copied by Role Play or swapped by Skill Swap."},{"id":26,"name":"Levitate","description":"Immune to Ground moves. This immunity is lost if this Pokémon uses Ingrain."},{"id":27,"name":"Effect Spore","description":"When hit by a contact move, 10% chance for the attacker to become afflicted with Poison, Paralysis, or Sleep; with an equal chance of each. It's possible the random status won't affect the attacker, in the case that it is immune to that status."},{"descriptionEmerald":"While at the head of the party, there is a 50% chance that a wild encounter Pokémon will have the same nature as this Pokémon.","id":28,"name":"Synchronize","description":"When a Pokémon inflicts Poison, Paralysis, or Burn on this Pokémon, that Pokémon will be inflicted with the same status condition, if possible."},{"id":29,"name":"Clear Body","description":"Prevents stat reductions caused by opposing Pokémons' moves and abilities."},{"id":30,"name":"Natural Cure","description":"Heals any status conditions on switching out or ending a battle."},{"descriptionEmerald":"While at the head of the party, Trainers registered with the PokéNav's Match Call feature will call twice as often.","id":31,"name":"Lightningrod","description":"Absorbs electric moves, raising Special Attack one stage."},{"id":32,"name":"Serene Grace","description":"Doubles the chance of secondary effects from this Pokémon's moves."},{"id":33,"name":"Swift Swim","description":"Doubles Speed stat during rain."},{"id":34,"name":"Chlorophyll","description":"Doubles Speed stat when the weather is sunny."},{"id":35,"name":"Illuminate","description":"Increases the wild encounter rate by 100%. Prevents accuracy from being lowered and ignores evasion changes."},{"id":36,"name":"Trace","description":"Copies a random opposing Pokémon's Ability when this Pokémon enters battle."},{"id":37,"name":"Huge Power","description":"Doubles this Pokémon's Attack stat."},{"id":38,"name":"Poison Point","description":"When hit by a contact move, 1/3 chance to inflict Poison on the attacker."},{"id":39,"name":"Inner Focus","description":"Prevents flinching and intimidate."},{"descriptionEmerald":"Decreases the time needed to hatch an Egg by half.","id":40,"name":"Magma Armor","description":"Cannot be frozen. Gaining this Ability, like through Skill Swap, will cure Freeze."},{"id":41,"name":"Water Veil","description":"Cannot be burned. Gaining this Ability, like through Skill Swap, will cure a Burn."},{"descriptionEmerald":"While at the head of the party, wild encounters have a 50% chance of being against a Steel Pokémon, if possible.","id":42,"name":"Magnet Pull","description":"Prevents allied and opposing Steel Pokémon from switching out."},{"id":43,"name":"Soundproof","description":"Immune to sound-based moves. These moves are: GrassWhistle, Growl, Heal Bell, Hyper Voice, Metal Sound, Perish Song, Roar, Screech, Sing, Snore, Supersonic, Uproar"},{"id":44,"name":"Rain Dish","description":"Heals this Pokémon for 1/16 max HP after each turn during rain."},{"id":45,"name":"Sand Stream","description":"Changes weather to a sandstorm when switched in. Prevents sandstorm damage."},{"descriptionEmerald":"While at the head of the party, 50% chance that a wild encounter Pokémon will be the highest level it could appear.","id":46,"name":"Pressure","description":"When a moves targets this Pokémon, one additional PP is deducted. A Pokémon can still target this Pokémon with a move if it only has 1 PP remaining for it."},{"id":47,"name":"Thick Fat","description":"Damage received from Ice or Fire moves is halved."},{"id":48,"name":"Early Bird","description":"Spends half as many turns asleep, rounded down."},{"descriptionEmerald":"Decreases the time needed to hatch an Egg by half.","id":49,"name":"Flame Body","description":"When hit by a contact move, 1/3 chance to burn the attacker."},{"id":50,"name":"Run Away","description":"Running away from wild encounters always succeeds."},{"descriptionEmerald":"While at the head of the party, 50% chance to prevent a wild encounter that would have been with a Pokémon 5 or more levels lower than this Pokémon.","id":51,"name":"Keen Eye","description":"Prevents accuracy from being lowered and ignores evasion changes."},{"descriptionEmerald":"If this Pokémon uses Cut in the overworld, the radius of the Cut tall grass is increased by one.","id":52,"name":"Hyper Cutter","description":"This Pokémon's Attack stat cannot be lowered by other Pokémon."},{"descriptionEmerald":"The types of items obtained vary according to this Pokémon's level, or the current level of the Battle Pyramid.","id":53,"name":"Pickup","description":"After winning a battle, there is a 10% chance that this Pokémon will be holding an item, if it was not already holding one."},{"id":54,"name":"Truant","description":"Every other turn using a move in battle, this Pokémon instead loafs around and does nothing."},{"descriptionEmerald":"While at the head of the party, 50% chance that a wild encounter Pokémon will be the highest level it could appear.","id":55,"name":"Hustle","description":"Increases Attack stat by 50%, but decreases the Accuracy of physical moves by 20%."},{"descriptionEmerald":"While at the head of the party, 2/3 chance that a wild encounter will be forced to the opposite gender of this Pokémon, if possible.","id":56,"name":"Cute Charm","description":"When hit by a contact move, 1/3 chance to inflict infatuation on the attacker. Has no effect if this Pokémon is genderless, or the same gender as the attacker."},{"id":57,"name":"Plus","description":"When in a Double Battle where any active Pokémon has the Ability Minus, this Pokémon's Special Attack stat increases by 50%."},{"id":58,"name":"Minus","description":"When in a Double Battle where any active Pokémon has the Ability Plus, this Pokémon's Special Attack stat increases by 50%."},{"id":59,"name":"Forecast","description":"Castform's type changes with the weather. Fire while sunny, Water while raining, or Ice while hailing. Cloud Nine and Air Lock disable this effect. This ability has no effect if a Pokémon other than Castform obtains this ability."},{"descriptionEmerald":"Increases the chance of getting bites while fishing.","id":60,"name":"Sticky Hold","description":"This Pokémon's held item cannot be taken or removed."},{"id":61,"name":"Shed Skin","description":"1/3 chance at the end of every turn to cure major status conditions (Burn, Poison, Paralysis, Freeze, Sleep)."},{"id":62,"name":"Guts","description":"Increases this Pokémon's Attack stat by 50% when affected by a major status condition (Burn, Poison, Paralysis, Freeze, Sleep), and ignores the Attack reduction of Burn."},{"id":63,"name":"Marvel Scale","description":"Increases this Pokémon's Defense stat by 50% when affected by a major status condition (Burn, Poison, Paralysis, Freeze, Sleep)."},{"id":64,"name":"Liquid Ooze","description":"HP draining moves used against this Pokémon cause the attacker to instead lose the HP they would have healed."},{"id":65,"name":"Overgrow","description":"If this Pokémon is at or below 1/3 of its max HP, the power of their Grass moves is increased by 50%."},{"id":66,"name":"Blaze","description":"If this Pokémon is at or below 1/3 of its max HP, the power of their Fire moves is increased by 50%."},{"id":67,"name":"Torrent","description":"If this Pokémon is at or below 1/3 of its max HP, the power of their Water moves is increased by 50%."},{"descriptionEmerald":"Increases the frequency at which wild Pokémons' cries are heard in the overworld.","id":68,"name":"Swarm","description":"If this Pokémon is at or below 1/3 of its max HP, the power of their Bug moves is increased by 50%."},{"id":69,"name":"Rock Head","description":"Prevents recoil damage from moves, except for Struggle."},{"id":70,"name":"Drought","description":"Changes weather to sunny when switched in. In sun, Fire moves have 50% increased power and Water moves have 50% decreased power. Removes the charging turn for Solarbeam, lowers the Accuracy of Thunder to 50%, and causes Moonlight, Synthesis, and Morning Sun to heal 2/3 max HP."},{"descriptionEmerald":"Increases the wild encounter rate by 100%.","id":71,"name":"Arena Trap","description":"Prevents opposing Pokémon from switching out or fleeing, except Flying-types and Pokémon with Levitate."},{"descriptionEmerald":"While at the head of the party, 50% chance that a wild encounter will be at the highest possible level that Pokémon could appear.","id":72,"name":"Vital Spirit","description":"Cannot be put to sleep. If this Pokémon tries to use Rest, it will fail. Gaining this Ability, like through Skill Swap, will cure Sleep."},{"descriptionEmerald":"While at the head of the party, decreases the wild encounter rate by 50%.","id":73,"name":"White Smoke","description":"Prevents stat reductions caused by opposing Pokémons' moves and abilities."},{"id":74,"name":"Pure Power","description":"Doubles this Pokémon's Attack stat."},{"id":75,"name":"Shell Armor","description":"Prevents this Pokémon from receiving critical hits."},{"id":76,"name":"Cacophony","description":"Immune to sound-based moves. These moves are: GrassWhistle, Growl, Heal Bell, Hyper Voice, Metal Sound, Perish Song, Roar, Screech, Sing, Snore, Supersonic, Uproar."},{"id":77,"name":"Air Lock","description":"Negates all effects of weather, but does not end the weather."},{"id":78,"name":"Tangled Feet","description":"Doubles evasion when confused."},{"id":79,"name":"Motor Drive","description":"Absorbs electric moves, raising Speed one stage."},{"id":80,"name":"Rivalry","description":"Increases damage inflicted to 1.25x against Pokémon of the same gender, but decreases damage to 0.75x against the opposite gender."},{"id":81,"name":"Steadfast","description":"Raises Speed one stage upon flinching."},{"id":82,"name":"Snow Cloak","description":"Increases Evasion to 1.2x during hail. Protects against hail damage."},{"id":83,"name":"Heatproof","description":"Halves damage from fire moves and burns."},{"id":84,"name":"Simple","description":"Doubles all stat modifiers, whether positive or negative."},{"id":85,"name":"Dry Skin","description":"Causes 1/8 max HP in damage each turn during strong sunlight, but heals for 1/8 max HP during rain. Increases damage from fire moves to 1.25x, but absorbs water moves, healing for 1/4 max HP."},{"id":86,"name":"Iron Fist","description":"Strengthens punch-based moves to 1.2x their power."},{"id":87,"name":"Adaptability","description":"Increases the same-type attack bonus from 1.5x to 2x."},{"id":88,"name":"Skill Link","description":"Extends two-to-five-hit moves to their full length every time."},{"id":89,"name":"Hydration","description":"Cures any major status ailment after each turn during rain."},{"id":90,"name":"Solar Power","description":"Increases Special Attack to 1.5x but costs 1/8 max HP after each turn during strong sunlight."},{"id":91,"name":"Quick Feet","description":"Increases Speed to 1.5x with a major status ailment."},{"id":92,"name":"Sniper","description":"Strengthens critical hits to inflict 3x damage rather than 2x."},{"id":93,"name":"No Guard","description":"Ensures non-OHKO moves used by and against the Pokémon hit."},{"id":94,"name":"Technician","description":"Strengthens moves of 60 base power or less to 1.5x their power."},{"id":95,"name":"Leaf Guard","description":"Protects against major status ailments during strong sunlight."},{"id":96,"name":"Super Luck","description":"Raises moves' critical hit rates one stage."},{"id":97,"name":"Unaware","description":"Ignores other Pokémon's stat modifiers for damage and Accuracy calculation."},{"id":98,"name":"Tinted Lens","description":"Doubles damage inflicted with not-very-effective moves."},{"id":99,"name":"Filter","description":"Decreases damage taken from super-effective moves by 1/4."},{"id":100,"name":"Scrappy","description":"Prevents Intimidate and lets the Pokémon's normal and fighting moves hit ghost Pokémon."},{"id":101,"name":"Storm Drain","description":"Absorbs water moves, raising Special Attack one stage."},{"id":102,"name":"Ice Body","description":"Heals for 1/16 max HP after each turn during hail. Protects against hail damage."},{"id":103,"name":"Snow Warning","description":"Summons hail that lasts indefinitely upon entering battle. Protects against hail damage."},{"id":104,"name":"Reckless","description":"Strengthens recoil moves to 1.2x their power."},{"id":105,"name":"Contrary","description":"Inverts stat changes."},{"id":106,"name":"Defiant","description":"Raises Attack two stages upon having any stat lowered."},{"id":107,"name":"Weak Armor","description":"Raises Speed and lowers Defense by one stage each upon being hit by a physical move."},{"id":108,"name":"Multiscale","description":"Halves damage taken from full HP."},{"id":109,"name":"Toxic Boost","description":"Increases Attack to 1.5x when poisoned."},{"id":110,"name":"Flare Boost","description":"Increases Special Attack to 1.5x when burned."},{"id":111,"name":"Overcoat","description":"Protects against damage from weather."},{"id":112,"name":"Big Pecks","description":"Prevents Defense from being lowered."},{"id":113,"name":"Sand Rush","description":"Doubles Speed during a sandstorm. Protects against sandstorm damage."},{"id":114,"name":"Wonder Skin","description":"Lowers incoming non-damaging moves' base accuracy to exactly 50%."},{"id":115,"name":"Analytic","description":"Strengthens moves to 1.3x their power when moving last."},{"id":116,"name":"Infiltrator","description":"Bypasses Light Screen, Reflect, and Safeguard."},{"id":117,"name":"Justified","description":"Raises Attack one stage upon taking damage from a dark move."},{"id":118,"name":"Rattled","description":"Raises Speed one stage upon being hit by a dark, ghost, bug move, or Intimidate."},{"id":119,"name":"Sap Sipper","description":"Absorbs grass moves, raising Attack one stage."},{"id":120,"name":"Sand Force","description":"Strengthens rock, ground, and steel moves to 1.3x their power during a sandstorm. Protects against sandstorm damage."},{"id":121,"name":"Download","description":"Raises the Attack stat corresponding to the opponents' weaker Defense one stage upon entering battle."},{"id":122,"name":"Flower Gift","description":"Increases friendly Pokémon's Attack and Special Defense to 1.5x during strong sunlight."},{"id":123,"name":"Moody","description":"Raises a random stat two stages and lowers another one stage after each turn."},{"id":124,"name":"Prankster","description":"Raises non-damaging moves' priority by one stage."},{"id":125,"name":"Victory Star","description":"Increases moves' accuracy to 1.3x for friendly Pokémon."},{"id":126,"name":"Anger Point","description":"Raises Attack by two stages upon receiving a critical hit."},{"id":127,"name":"Aftermath","description":"50% chance to deal 1/4 of the attacker's max HP when KO'd by a contact move."},{"id":128,"name":"Moxie","description":"50% chance to raise Attack one stage upon KOing a Pokémon."}]